Blog/multilingual-support-with-ob-translate-and-google-translate.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.55 in css mode. -->
<html>
  <head>
    <title>multilingual-support-with-ob-translate-and-google-translate.org</title>
  </head>
  <body>
    <pre>
<span class="org-document-info-keyword">#+TITLE:</span> <span class="org-document-title">multilingual support with ob-translate and google-translate
</span>
<span class="org-level-1">* Why multilingual support?
</span>
<span class="org-block-begin-line">#+begin_src translate :src auto :dest zh-CN,zh-TW,ja,ko
</span><span class="org-block">On the internet, English is the main language. But currently translation is good
enough now. In my previous blog posts I use two languages to write, it is take
much time. I want t a simpler automatic way to do this.
</span><span class="org-block-end-line">#+end_src
</span>
<span class="org-meta-line">#+RESULTS[&lt;2018-04-21 16:14:47&gt; f94aff19787f76c9e0faea4cf7522a0c6259765d]:</span>
<span class="org-table">| zh-CN | &#22312;&#20114;&#32852;&#32593;&#19978;&#65292;&#33521;&#35821;&#26159;&#20027;&#35201;&#30340;&#35821;&#35328;&#12290;&#20294;&#26159;&#29616;&#22312;&#32763;&#35793;&#24050;&#32463;&#22815;&#22909;&#20102;&#12290;&#22312;&#25105;&#20197;&#21069;&#30340;&#21338;&#23458;&#25991;&#31456;&#20013;&#65292;&#25105;&#20351;&#29992;&#20004;&#31181;&#35821;&#35328;&#32534;&#20889;&#65292;&#36825;&#38656;&#35201;&#24456;&#38271;&#26102;&#38388;&#12290;&#25105;&#24819;&#35201;&#19968;&#20010;&#26356;&#31616;&#21333;&#30340;&#33258;&#21160;&#26041;&#24335;&#26469;&#20570;&#21040;&#36825;&#19968;&#28857;&#12290;                                      |</span>
<span class="org-table">| zh-TW | &#22312;&#20114;&#32879;&#32178;&#19978;&#65292;&#33521;&#35486;&#26159;&#20027;&#35201;&#30340;&#35486;&#35328;&#12290;&#20294;&#26159;&#29694;&#22312;&#32763;&#35695;&#24050;&#32147;&#22816;&#22909;&#20102;&#12290;&#22312;&#25105;&#20197;&#21069;&#30340;&#21338;&#23458;&#25991;&#31456;&#20013;&#65292;&#25105;&#20351;&#29992;&#20841;&#31278;&#35486;&#35328;&#32232;&#23531;&#65292;&#36889;&#38656;&#35201;&#24456;&#38263;&#26178;&#38291;&#12290;&#25105;&#24819;&#35201;&#19968;&#20491;&#26356;&#31777;&#21934;&#30340;&#33258;&#21205;&#26041;&#24335;&#20358;&#20570;&#21040;&#36889;&#19968;&#40670;&#12290;                                      |</span>
<span class="org-table">| ja    | &#12452;&#12531;&#12479;&#12540;&#12493;&#12483;&#12488;&#12391;&#12399;&#12289;&#33521;&#35486;&#12364;&#20027;&#35201;&#35328;&#35486;&#12391;&#12377;&#12290;&#12375;&#12363;&#12375;&#12289;&#29694;&#22312;&#12398;&#12392;&#12371;&#12429;&#32763;&#35379;&#12399;&#21313;&#20998;&#12391;&#12377;&#12290;&#20197;&#21069;&#12398;&#12502;&#12525;&#12464;&#35352;&#20107;&#12391;&#12399;&#12289;2&#12388;&#12398;&#35328;&#35486;&#12434;&#20351;&#12387;&#12390;&#26360;&#12365;&#12414;&#12375;&#12383;&#12364;&#12289;&#26178;&#38291;&#12364;&#12363;&#12363;&#12426;&#12414;&#12377;&#12290;&#31169;&#12399;&#12371;&#12428;&#12434;&#34892;&#12358;&#31777;&#21336;&#12394;&#33258;&#21205;&#26041;&#27861;&#12434;&#12375;&#12383;&#12356;&#12391;&#12377;&#12290; |</span>
<span class="org-table">| ko    | &#51064;&#53552;&#45367;&#50640;&#49436; &#50689;&#50612;&#44032; &#51452;&#50836; &#50616;&#50612;&#51077;&#45768;&#45796;. &#44536;&#47084;&#45208; &#54788;&#51116; &#48264;&#50669;&#51008; &#54788;&#51116; &#52649;&#48516;&#54633;&#45768;&#45796;. &#51060;&#51204; &#44544;&#50640;&#49436; &#46160; &#50616;&#50612;&#47484; &#49324;&#50857;&#54616;&#50668; &#44544;&#51012; &#50424; &#46412; &#49884;&#44036;&#51060; &#47566;&#51060; &#44152;&#47549;&#45768;&#45796;. &#51060; &#51089;&#50629;&#51012; &#49688;&#54665;&#54616;&#45716; &#45908; &#44036;&#45800;&#54620; &#51088;&#46041; &#48169;&#48277;&#51012; &#50896;&#54633;&#45768;&#45796;.     |</span>


<span class="org-level-1">* How it looks like
</span>
<span class="org-block-begin-line">#+begin_src org
</span><span class="org-block">,#+begin_src translate :src zh-CN :dest en,zh-TW,ja,ko
&#20320;&#22909;&#65292;&#25105;&#21483;&#38463;&#22269;&#12290;
,#+end_src

,#+RESULTS[&lt;2018-04-21 16:17:39&gt; 7982d9e369a56107e0b9252c5b1a7753bd6ecef0]:
</span><span class="org-block"><span class="org-table">| en    | Hello, my name is Aguo.              |</span></span><span class="org-block">
</span><span class="org-block"><span class="org-table">| zh-TW | &#20320;&#22909;&#65292;&#25105;&#21483;&#38463;&#22283;&#12290;                     |</span></span><span class="org-block">
</span><span class="org-block"><span class="org-table">| ja    | &#12371;&#12435;&#12395;&#12385;&#12399;&#12289;&#31169;&#12398;&#21517;&#21069;&#12399;&#12450;&#12464;&#12540;&#12458;&#12391;&#12377;&#12290; |</span></span><span class="org-block">
</span><span class="org-block"><span class="org-table">| ko    | &#50504;&#45397;, &#45236; &#51060;&#47492;&#51008; &#50500;&#44396;&#50500; &#50556;.           |</span></span><span class="org-block">
</span><span class="org-block-end-line">#+end_src
</span>

<span class="bold">NOTE</span>: Not allow space between langs (<span class="org-code">en,zh-TW,ja,ko</span>). Other wise it does not wok.

<span class="org-level-1">* Multilingual support setup
</span>
Multilingual support is simple to integrate. Especially like great tool Emacs
and Org-mode. I remember a great tool "ob-translate" which use
"<span class="org-link"><a href="https://github.com/atykhonov/google-translate">google-translate</a></span>" as backend support. Really simple to use in Org-mode
(especial I publish whole website with Org-mode org-publish).

<span class="custom">*</span><span class="org-level-2">* configure ob-translate
</span>
My sample config here:

<span class="org-block-begin-line">#+begin_src emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">use-package</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">ob-translate</span></span><span class="org-block">
  </span><span class="org-block"><span class="builtin">:ensure</span></span><span class="org-block"> t
  </span><span class="org-block"><span class="builtin">:init</span></span><span class="org-block">
  (add-to-list 'org-babel-load-languages '(translate . t))
  (org-babel-do-load-languages 'org-babel-load-languages org-babel-load-languages)
  </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">add translate special block into structure template alist.
</span></span><span class="org-block">  (add-to-list 'org-structure-template-alist '(</span><span class="org-block"><span class="string">"t"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"src translate"</span></span><span class="org-block">)))
</span><span class="org-block-end-line">#+end_src
</span>
I added ob-translate src block into Org-mode new structure template alist.

<span class="custom">**</span><span class="org-level-3">* require org-mode export src blocks export with results
</span>
<span class="org-block-begin-line">#+begin_src emacs-lisp
</span><span class="org-block">(add-to-list 'org-babel-default-header-args '(</span><span class="org-block"><span class="builtin">:eval</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"never-export"</span></span><span class="org-block">))
(add-to-list 'org-babel-default-header-args '(</span><span class="org-block"><span class="builtin">:exports</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"both"</span></span><span class="org-block">))
</span><span class="org-block-end-line">#+end_src
</span>
- The first let Org-mode don't evaluate src blocks when exporting.
- The second let Org-mode export src blocks with results.

<span class="custom">**</span><span class="org-level-3">* create a snippet for easy inserting template
</span>
<span class="org-block-begin-line">#+begin_src snippet
</span><span class="org-block"><span class="comment"># -*- mode: snippet -*-</span></span><span class="org-block">
</span><span class="org-block"><span class="comment"># name: ob-translate</span></span><span class="org-block">
</span><span class="org-block"><span class="comment"># key: babel-translate</span></span><span class="org-block">
</span><span class="org-block"><span class="comment"># group: babel</span></span><span class="org-block">
</span><span class="org-block"><span class="comment"># expand-env: ((yas-indent-line 'fixed) (yas-wrap-around-region 't))</span></span><span class="org-block">
</span><span class="org-block"><span class="comment"># --</span></span><span class="org-block">
,#+begin_src translate :src </span><span class="org-block"><span class="keyword">${</span></span><span class="org-block"><span class="warning">1</span></span><span class="org-block"><span class="keyword">:</span></span><span class="org-block">source: auto, en, zh-CN</span><span class="org-block"><span class="keyword">}</span></span><span class="org-block"> :dest </span><span class="org-block"><span class="keyword">${</span></span><span class="org-block"><span class="warning">2</span></span><span class="org-block"><span class="keyword">:</span></span><span class="org-block">en,zh-KW,ja,ko</span><span class="org-block"><span class="keyword">}</span></span><span class="org-block">
</span><span class="org-block"><span class="keyword">$</span></span><span class="org-block"><span class="string">0</span></span><span class="org-block">
,#+end_src
</span><span class="org-block-end-line">#+end_src
</span>
<span class="custom">*</span><span class="org-level-2">* configure google-translate if you use it interactively
</span>
Here is my config example:

<span class="org-block-begin-line">#+begin_src emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">use-package</span></span><span class="org-block"> </span><span class="org-block"><span class="constant">google-translate</span></span><span class="org-block">
  </span><span class="org-block"><span class="builtin">:ensure</span></span><span class="org-block"> t
  </span><span class="org-block"><span class="builtin">:defer</span></span><span class="org-block"> t
  </span><span class="org-block"><span class="builtin">:bind</span></span><span class="org-block"> (</span><span class="org-block"><span class="builtin">:map</span></span><span class="org-block"> dictionary-prefix
              (</span><span class="org-block"><span class="string">"t"</span></span><span class="org-block"> . google-translate-smooth-translate)
              (</span><span class="org-block"><span class="string">"C-t"</span></span><span class="org-block"> . google-translate-at-point)
              (</span><span class="org-block"><span class="string">"M-t"</span></span><span class="org-block"> . google-translate-query-translate)
              (</span><span class="org-block"><span class="string">"C-r"</span></span><span class="org-block"> . google-translate-at-point-reverse)
              (</span><span class="org-block"><span class="string">"M-r"</span></span><span class="org-block"> . google-translate-query-translate-reverse))
  </span><span class="org-block"><span class="builtin">:init</span></span><span class="org-block">
  (add-to-list 'display-buffer-alist
               '(</span><span class="org-block"><span class="string">"^\\*Google Translate\\*"</span></span><span class="org-block"> . (display-buffer-below-selected)))
  </span><span class="org-block"><span class="builtin">:config</span></span><span class="org-block">
  (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> google-translate-enable-ido-completion nil
        google-translate-show-phonetic t
        </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">google-translate-listen-program
</span></span><span class="org-block">        google-translate-output-destination nil </span><span class="org-block"><span class="comment-delimiter">; </span></span><span class="org-block"><span class="comment">'echo-area, 'popup
</span></span><span class="org-block">        google-translate-pop-up-buffer-set-focus t
        </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">`</span></span><span class="org-block"><span class="comment"><span class="constant">google-translate-supported-languages</span></span></span><span class="org-block"><span class="comment">'
</span></span><span class="org-block">        google-translate-default-target-language </span><span class="org-block"><span class="string">"zh-CN"</span></span><span class="org-block">
        </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">for `</span></span><span class="org-block"><span class="comment"><span class="constant">google-translate-smooth-translate</span></span></span><span class="org-block"><span class="comment">' + [C-n/p]
</span></span><span class="org-block">        google-translate-translation-directions-alist '((</span><span class="org-block"><span class="string">"en"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"zh-CN"</span></span><span class="org-block">)
                                                        (</span><span class="org-block"><span class="string">"zh-CN"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"en"</span></span><span class="org-block">)
                                                        (</span><span class="org-block"><span class="string">"zh-CN"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"ja"</span></span><span class="org-block">)
                                                        (</span><span class="org-block"><span class="string">"zh-CN"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"ko"</span></span><span class="org-block">))
        ))
</span><span class="org-block-end-line">#+end_src
</span>
You should explore google-translate features on its readme page, really convinient.

<span class="custom">*</span><span class="org-level-2">* about Google Translate service not accessible issue
</span>
I'm writing a simple global minor mode to toggle proxy (support HTTP, socks)
from inside of Emacs, instead of system global.

For now, you can simply use my helper function:

<span class="org-block-begin-line">#+begin_src emacs-lisp
</span><span class="org-block">(</span><span class="org-block"><span class="keyword">defvar</span></span><span class="org-block"> </span><span class="org-block"><span class="variable-name">my:proxy-toggle-p</span></span><span class="org-block"> nil
  </span><span class="org-block"><span class="doc">"A global variable indicate current proxy toggle status.
Used by function `</span></span><span class="org-block"><span class="doc"><span class="constant">my:proxy-toggle</span></span></span><span class="org-block"><span class="doc">'."</span></span><span class="org-block">)

(</span><span class="org-block"><span class="keyword">defun</span></span><span class="org-block"> </span><span class="org-block"><span class="function-name">my:proxy-toggle</span></span><span class="org-block"> (proxy)
  </span><span class="org-block"><span class="doc">"A command to toggle `</span></span><span class="org-block"><span class="doc"><span class="constant">PROXY</span></span></span><span class="org-block"><span class="doc">' for Emacs."</span></span><span class="org-block">
  (</span><span class="org-block"><span class="keyword">interactive</span></span><span class="org-block"> (list (</span><span class="org-block"><span class="keyword">unless</span></span><span class="org-block"> my:proxy-toggle-p
                       (completing-read </span><span class="org-block"><span class="string">"Select a proxy routine: "</span></span><span class="org-block"> '(</span><span class="org-block"><span class="string">"socks"</span></span><span class="org-block"> </span><span class="org-block"><span class="string">"url_proxy_services"</span></span><span class="org-block"> </span><span class="org-block"><span class="string">"env HTTP_PROXY"</span></span><span class="org-block">)))))
  (</span><span class="org-block"><span class="keyword">if</span></span><span class="org-block"> my:proxy-toggle-p
      (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> my:proxy-toggle-p nil)
    (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> my:proxy-toggle-p proxy))
  (</span><span class="org-block"><span class="keyword">pcase</span></span><span class="org-block"> my:proxy-toggle-p
    (</span><span class="org-block"><span class="string">"socks"</span></span><span class="org-block">
     (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> url-gateway-method 'socks
           socks-noproxy '(</span><span class="org-block"><span class="string">"localhost"</span></span><span class="org-block">)
           socks-server '(</span><span class="org-block"><span class="string">"Default server"</span></span><span class="org-block"> </span><span class="org-block"><span class="string">"127.0.0.1"</span></span><span class="org-block"> 1086 5)))
    (</span><span class="org-block"><span class="string">"url_proxy_services"</span></span><span class="org-block">
     (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> url-proxy-services
           '((</span><span class="org-block"><span class="string">"http"</span></span><span class="org-block">  . </span><span class="org-block"><span class="string">"127.0.0.1:8118"</span></span><span class="org-block">)
             (</span><span class="org-block"><span class="string">"https"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"127.0.0.1:8118"</span></span><span class="org-block">)
             (</span><span class="org-block"><span class="string">"ftp"</span></span><span class="org-block">   . </span><span class="org-block"><span class="string">"127.0.0.1:8118"</span></span><span class="org-block">)
             </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">don't use `</span></span><span class="org-block"><span class="comment"><span class="constant">localhost</span></span></span><span class="org-block"><span class="comment">', avoid robe server (For Ruby) can't response.
</span></span><span class="org-block">             (</span><span class="org-block"><span class="string">"no_proxy"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"127.0.0.1"</span></span><span class="org-block">)
             (</span><span class="org-block"><span class="string">"no_proxy"</span></span><span class="org-block"> . </span><span class="org-block"><span class="string">"^.*</span></span><span class="org-block"><span class="string"><span class="regexp-grouping-backslash">\\</span></span></span><span class="org-block"><span class="string"><span class="regexp-grouping-construct">(</span></span></span><span class="org-block"><span class="string">baidu</span></span><span class="org-block"><span class="string"><span class="regexp-grouping-backslash">\\</span></span></span><span class="org-block"><span class="string"><span class="regexp-grouping-construct">|</span></span></span><span class="org-block"><span class="string">sina)\\.com"</span></span><span class="org-block">)
             )))
    (</span><span class="org-block"><span class="string">"env HTTP_PROXY"</span></span><span class="org-block">
     </span><span class="org-block"><span class="comment-delimiter">;; </span></span><span class="org-block"><span class="comment">Privoxy
</span></span><span class="org-block">     (setenv </span><span class="org-block"><span class="string">"HTTP_PROXY"</span></span><span class="org-block">  </span><span class="org-block"><span class="string">"<a href="http://localhost:8118">http://localhost:8118</a>"</span></span><span class="org-block">)
     (setenv </span><span class="org-block"><span class="string">"HTTPS_PROXY"</span></span><span class="org-block"> </span><span class="org-block"><span class="string">"<a href="http://localhost:8118">http://localhost:8118</a>"</span></span><span class="org-block">))
    (_
     (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> url-gateway-method 'native)
     (</span><span class="org-block"><span class="keyword">setq</span></span><span class="org-block"> url-proxy-services nil)
     (setenv </span><span class="org-block"><span class="string">"HTTP_PROXY"</span></span><span class="org-block">  nil)
     (setenv </span><span class="org-block"><span class="string">"HTTPS_PROXY"</span></span><span class="org-block"> nil))
    ))
</span><span class="org-block-end-line">#+end_src
</span>

<span class="org-level-1">* Some issues
</span>
<span class="custom">*</span><span class="org-level-2">* the Babel result output type is table
</span>
The Babel result output type is table, it seems is forced, I will try to figure
a way to fix this problem. Might add an PR to "ob-translate".

<span class="custom">*</span><span class="org-level-2">* ob-translate can't be used anywhere in Org-mode buffer
</span>
Like headlines, ob-translate can't apply on them. But google-translate does not
support output to current buffer with option
<span class="org-code">google-translate-output-destination</span>. This should be improved like output to
current buffer (insert at point).


<span class="org-level-1">* Any updates will updated in this post
</span>
<span class="org-level-1">* use external tools to translate with ob-shell
</span>
There are some command-lines tools can translate text. For example, <span class="org-link"><a href="https://github.com/afc163/fanyi">fanyi</a></span>. Unfortunally,
some tools use online service which only support Chinese&lt;-&gt;English.

For ob-shell, want to get raw text instead of org-code result, then you need to specify
header argument <span class="org-code">:results raw</span>.

Another problem is that the result usually formatted by command-line tools separately. You
might need other text processing commands like <span class="org-verbatim">sed</span>, <span class="org-verbatim">awk</span> etc to strip some text.

<span class="custom">*</span><span class="org-level-2">* fanyi
</span>
<span class="org-block-begin-line">#+begin_src shell :results raw
</span><span class="org-block">fanyi </span><span class="org-block"><span class="string">"&#20320;&#22909;&#65292;&#19990;&#30028;"</span></span><span class="org-block">
</span><span class="org-block-end-line">#+end_src
</span>
<span class="org-meta-line">#+RESULTS[&lt;2018-05-14 21:50:44&gt; 048f42580fce295f1dc0ecb3bb62f05755d5a8f6]:</span>

 &#20320;&#22909;&#65292;&#19990;&#30028;  ~  iciba.com
 
  -------- 
 
 &#20320;&#22909;&#65292;&#19990;&#30028;  ~  fanyi.youdao.com
 
  -------- 
 

</pre>
  </body>
</html>
